docs/zsh-theme.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>My ZShell Theme</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="My ZShell Theme"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-03-03T14:08-0800"/>
<meta name="author" content="Howard Abrams"/>
<meta name="description" content="A prompt configuration&hellip;er, theme for Zsh"/>
<meta name="keywords" content=""/>
<link rel='stylesheet' href='http://www.howardism.org/styles/org-export-html-style.css' type='text/css'/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">My ZShell Theme</h1>

<p>This file describes my ZShell Theme&hellip; essentially my prompt.
It has two parts, the left side, <code>PROMPT</code> shows a happy face for
every process that works.
</p>
<p>
The right side, <code>RPROMPT</code> show a traffic light signal to represent
the current Git status.
</p>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">Happy Prompt</h2>
<div class="outline-text-2" id="text-1">


<p>
  We first need to load the special prompt features as well as the
  nicer color variables:
</p>



<pre class="src src-sh">setopt prompt_subst
autoload -U colors &amp;&amp; colors
</pre>


<p>
  Our prompt checks the last command ran, and displays a red sad
  face, if the command failed. Cute, true, but I'm not sure how
  useful it is.
</p>
<p>
  Prompt options:
</p><ul>
<li>%n - User's name: habrams
</li>
<li>%m - Machine name
</li>
<li>%~ - Current directory with HOME substituted
</li>
<li>%c - Basename of the current directory
</li>
<li>%d - Current directory without substitution
</li>
</ul>


<p>
  Prompt colors: %{%F{red}%}
</p><ul>
<li>red
</li>
<li>blue
</li>
<li>green
</li>
<li>yellow
</li>
</ul>





<pre class="src src-sh"><span style="color: #4271ae;">my_prompt_string</span>() {
  <span style="color: #8959a8;">local</span> <span style="color: #eab700;">ST</span>=$<span style="color: #eab700;">?</span>
  <span style="color: #eab700;">PROMPT_SAD</span>=<span style="color: #3e999f;">"%{%F{red}%}(O_o)%{$reset_color%}"</span>
  <span style="color: #eab700;">PROMPT_HAPPY</span>=<span style="color: #3e999f;">"%{%F{green}%}(^_^)%{$reset_color%}"</span>
  <span style="color: #eab700;">PROMPT_REST</span>=<span style="color: #3e999f;">"%{%F{yellow}%}%~%{$reset_color%}\n %{%F{blue}%}&#10140; %{$reset_color%}"</span>
  <span style="color: #718c00;">if</span> [[ $<span style="color: #eab700;">ST</span> = 0 ]]
  <span style="color: #718c00;">then</span>
      <span style="color: #8959a8;">echo</span> <span style="color: #3e999f;">"$PROMPT_HAPPY $PROMPT_REST "</span>
  <span style="color: #718c00;">else</span>
      <span style="color: #8959a8;">echo</span> <span style="color: #3e999f;">"$PROMPT_SAD $PROMPT_REST "</span>
  <span style="color: #718c00;">fi</span>
}
</pre>


<p>
  The prompt is simply the execution of our <code>my_prompt_string</code> function.
</p>



<pre class="src src-sh"><span style="color: #eab700;">PROMPT</span>=<span style="color: #3e999f;">'$(</span><span style="color: #8959a8;">my_prompt_string</span><span style="color: #3e999f;">)'</span>
</pre>



</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">Git Prompt</h2>
<div class="outline-text-2" id="text-2">


<p>
   According to <a href="http://blog.joshdick.net/2012/12/30/my_git_prompt_for_zsh.html">this article</a>, we have a clever way of describing the
   status of the current git repository with traffic lights.
</p>
<p>
   Modify the colors and symbols in these variables as desired.
</p>



<pre class="src src-sh"><span style="color: #eab700;">GIT_PROMPT_SYMBOL</span>=<span style="color: #3e999f;">"%{$fg[blue]%}&#177;"</span>
<span style="color: #eab700;">GIT_PROMPT_PREFIX</span>=<span style="color: #3e999f;">"%{$fg[green]%}[%{$reset_color%}"</span>
<span style="color: #eab700;">GIT_PROMPT_SUFFIX</span>=<span style="color: #3e999f;">"%{$fg[green]%}]%{$reset_color%}"</span>
<span style="color: #eab700;">GIT_PROMPT_AHEAD</span>=<span style="color: #3e999f;">"%{$fg[red]%}ANUM%{$reset_color%}"</span>
<span style="color: #eab700;">GIT_PROMPT_BEHIND</span>=<span style="color: #3e999f;">"%{$fg[cyan]%}BNUM%{$reset_color%}"</span>
<span style="color: #eab700;">GIT_PROMPT_MERGING</span>=<span style="color: #3e999f;">"%{$fg_bold[magenta]%}&#9889;&#65038;%{$reset_color%}"</span>
<span style="color: #eab700;">GIT_PROMPT_UNTRACKED</span>=<span style="color: #3e999f;">"%{$fg_bold[red]%}&#9679;%{$reset_color%}"</span>
<span style="color: #eab700;">GIT_PROMPT_MODIFIED</span>=<span style="color: #3e999f;">"%{$fg_bold[yellow]%}&#9679;%{$reset_color%}"</span>
<span style="color: #eab700;">GIT_PROMPT_STAGED</span>=<span style="color: #3e999f;">"%{$fg_bold[green]%}&#9679;%{$reset_color%}"</span>
</pre>


<p>
   Show Git branch/tag, or name-rev if on detached head
</p>



<pre class="src src-sh"><span style="color: #4271ae;">parse_git_branch</span>() {
  (git symbolic-ref -q HEAD || git name-rev --name-only --no-undefined --always HEAD) 2&gt; /dev/null
}
</pre>


<p>
   Show different symbols as appropriate for various Git repository states
</p>



<pre class="src src-sh"><span style="color: #4271ae;">parse_git_state</span>() {
  <span style="color: #8e908c; font-style: italic;"># </span><span style="color: #8e908c; font-style: italic;">Compose this value via multiple conditional appends.</span>
  <span style="color: #8959a8;">local</span> <span style="color: #eab700;">GIT_STATE</span>=<span style="color: #3e999f;">""</span>

  <span style="color: #8959a8;">local</span> <span style="color: #eab700;">NUM_AHEAD</span>=<span style="color: #3e999f;">"$(</span><span style="color: #8959a8;">git</span><span style="color: #3e999f;"> log --oneline @{u}.. 2&gt; /dev/null | wc -l | tr -d ' ')"</span>
  <span style="color: #718c00;">if</span> [ <span style="color: #3e999f;">"$NUM_AHEAD"</span> -gt 0 ]; <span style="color: #718c00;">then</span>
    <span style="color: #eab700;">GIT_STATE</span>=$<span style="color: #eab700;">GIT_STATE</span>${<span style="color: #eab700;">GIT_PROMPT_AHEAD</span>//NUM/$<span style="color: #eab700;">NUM_AHEAD</span>}
  <span style="color: #718c00;">fi</span>

  <span style="color: #8959a8;">local</span> <span style="color: #eab700;">NUM_BEHIND</span>=<span style="color: #3e999f;">"$(</span><span style="color: #8959a8;">git</span><span style="color: #3e999f;"> log --oneline ..@{u} 2&gt; /dev/null | wc -l | tr -d ' ')"</span>
  <span style="color: #718c00;">if</span> [ <span style="color: #3e999f;">"$NUM_BEHIND"</span> -gt 0 ]; <span style="color: #718c00;">then</span>
    <span style="color: #eab700;">GIT_STATE</span>=$<span style="color: #eab700;">GIT_STATE</span>${<span style="color: #eab700;">GIT_PROMPT_BEHIND</span>//NUM/$<span style="color: #eab700;">NUM_BEHIND</span>}
  <span style="color: #718c00;">fi</span>

  <span style="color: #8959a8;">local</span> <span style="color: #eab700;">GIT_DIR</span>=<span style="color: #3e999f;">"$(</span><span style="color: #8959a8;">git</span><span style="color: #3e999f;"> rev-parse --git-dir 2&gt; /dev/null)"</span>
  <span style="color: #718c00;">if</span> [ -n $<span style="color: #eab700;">GIT_DIR</span> ] &amp;&amp; <span style="color: #8959a8;">test</span> -r $<span style="color: #eab700;">GIT_DIR</span>/MERGE_HEAD; <span style="color: #718c00;">then</span>
    <span style="color: #eab700;">GIT_STATE</span>=$<span style="color: #eab700;">GIT_STATE</span>$<span style="color: #eab700;">GIT_PROMPT_MERGING</span>
  <span style="color: #718c00;">fi</span>

  <span style="color: #718c00;">if</span> [[ -n $(<span style="color: #8959a8;">git</span> ls-files --other --exclude-standard 2&gt; /dev/null) ]]; <span style="color: #718c00;">then</span>
    <span style="color: #eab700;">GIT_STATE</span>=$<span style="color: #eab700;">GIT_STATE</span>$<span style="color: #eab700;">GIT_PROMPT_UNTRACKED</span>
  <span style="color: #718c00;">fi</span>

  <span style="color: #718c00;">if</span> <span style="color: #718c00;">!</span> git diff --quiet 2&gt; /dev/null; <span style="color: #718c00;">then</span>
    <span style="color: #eab700;">GIT_STATE</span>=$<span style="color: #eab700;">GIT_STATE</span>$<span style="color: #eab700;">GIT_PROMPT_MODIFIED</span>
  <span style="color: #718c00;">fi</span>

  <span style="color: #718c00;">if</span> <span style="color: #718c00;">!</span> git diff --cached --quiet 2&gt; /dev/null; <span style="color: #718c00;">then</span>
    <span style="color: #eab700;">GIT_STATE</span>=$<span style="color: #eab700;">GIT_STATE</span>$<span style="color: #eab700;">GIT_PROMPT_STAGED</span>
  <span style="color: #718c00;">fi</span>

  <span style="color: #718c00;">if</span> [[ -n $<span style="color: #eab700;">GIT_STATE</span> ]]; <span style="color: #718c00;">then</span>
    <span style="color: #8959a8;">echo</span> <span style="color: #3e999f;">"$GIT_PROMPT_PREFIX$GIT_STATE$GIT_PROMPT_SUFFIX"</span>
  <span style="color: #718c00;">fi</span>
}
</pre>


<p>
   If inside a Git repository, print its branch and state
</p>



<pre class="src src-sh"><span style="color: #4271ae;">git_prompt_string</span>() {
  <span style="color: #8959a8;">local</span> <span style="color: #eab700;">git_where</span>=<span style="color: #3e999f;">"$(</span><span style="color: #8959a8;">parse_git_branch</span><span style="color: #3e999f;">)"</span>
  [ -n <span style="color: #3e999f;">"$git_where"</span> ] &amp;&amp; <span style="color: #8959a8;">echo</span> <span style="color: #3e999f;">"$GIT_PROMPT_SYMBOL$(</span><span style="color: #8959a8;">parse_git_state</span><span style="color: #3e999f;">)$GIT_PROMPT_PREFIX%{$fg[yellow]%}${git_where#(refs/heads/|tags/)}$GIT_PROMPT_SUFFIX"</span>
}
</pre>


<p>
   Set the right-hand prompt. Not sure why we don't use <code>RPROMPT</code>.
</p>



<pre class="src src-sh"><span style="color: #eab700;">RPROMPT</span>=<span style="color: #3e999f;">'$(</span><span style="color: #8959a8;">git_prompt_string</span><span style="color: #3e999f;">)'</span>
</pre>



</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3">Technical Gunk</h2>
<div class="outline-text-2" id="text-3">


<p>
  The following are the tangled settings. Type: <code>C-c C-v t</code>
  to create the script file.
</p>
</div>
</div>
</div>

</body>
</html>
